#+TITLE: doom-notes.org
#+STARTUP: fold

*** source code / literate programming
    To insert a snippet for source code: [SPC] i s and select begin_src

    Example 1 emacs-lisp
   #+BEGIN_SRC emacs-lisp
   (+ 3 58)

   #+END_SRC

   #+RESULTS:
   : 61

   and then pressing C-x C-e OR C-c C-c will show 61 in the mini buffer

    Example 2 python
   #+BEGIN_SRC python
   print(3+43+43+4)


   #+END_SRC
   C-c C-c inside the code block (not working)
   #+RESULTS:
   : None

** snippets
   Yasnippet & Yasnippet-snippets
   [SPC] i s
  This is the "incrementally" snippet in text-mode.
 
[SPC] i s or just <s [TAB]
The following was a begin src block
#+BEGIN_SRC emacs-lisp
(defun great (name)
  (concat "Hello " name))

(great "Dolly")

#+END_SRC

#+RESULTS:
: Hello Dolly


(To execute: M-x org-babel-execute-source-block :: I made a keybinding to do this. It is Q )


<s and [TAB]

#+BEGIN_SRC emacs-lisp
(+ 11 43)
#+END_SRC

#+RESULTS:
: 54

<l and [TAB]
#+BEGIN_EXPORT latex
/rarrow
#+END_EXPORT



appear
defamation

